Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The native image agent itself is a native executable produced with GraalVM that uses JVMTI to intercept the calls that require native image configuration. As a last resort, it is possible to debug the native image agent with GDB, see link:https://github.com/oracle/graal/blob/master/substratevm/src/com.oracle.svm.agent/README.md[here] for instructions on how to do that.
ja_jp: ネイティブイメージエージェント自体は、GraalVM で生成されたネイティブ実行可能ファイルであり、JVMTI を使用してネイティブイメージ設定を必要とする呼び出しをインターセプトします。 最後の手段として、GDB を使用してネイティブイメージエージェントをデバッグすることも可能です。 方法については、ink:https://github.com/oracle/graal/blob/master/substratevm/src/com.oracle.svm.agent/README.md[こちら] を参照してください。

source: The native image assessment above was performed using GraalVM 23.0.2.
ja_jp: 上記のネイティブイメージ評価は、GraalVM 23.0.2 を使用して実行されました。

source: The native image can also be locally tested using the `sam.native.yaml` template:
ja_jp: ネイティブイメージは、 `sam.native.yaml` テンプレートを使ってローカルでテストすることもできます。

source: The native image tracing agent can log the method invocations that result in the generated configuration to a JSON file. This can help understand why a configuration entry is generated. To enable this logging, `-Dquarkus.test.native.agent.output.property.name=trace-output` and `-Dquarkus.test.native.agent.output.property.value=native-image-agent-trace-file.json` system properties need to be added. For example:
ja_jp: ネイティブイメージトレースエージェントは、生成された設定をもたらすメソッド呼び出しを JSON ファイルに記録できます。 これは、設定エントリーが生成される理由を理解するのに役立ちます。 このロギングを有効にするには、 `-Dquarkus.test.native.agent.output.property.name=trace-output` および `-Dquarkus.test.native.agent.output.property.value=native-image-agent-trace-file.json` システムプロパティーを追加する必要があります。 たとえば:

source: The native image tracing agent is a JVM tool interface (JVMTI) agent available within both GraalVM and Mandrel that tracks all usages of dynamic features such as reflection, JNI, dynamic proxies, access classpath resources...etc, during an application's regular JVM execution. When the JVM stops, it dumps the information on the dynamic features used during the run onto a collection of native image configuration files that can be used in subsequent native image builds.
ja_jp: ネイティブイメージトレーシングエージェントは、GraalVM と Mandrel の両方で利用可能な JVM ツールインターフェイス (JVMTI) エージェントであり、アプリケーションの通常の JVM 実行中に リフレクション、JNI、動的プロキシー、クラスパスリソースへのアクセスなどの動的機能のすべての使用状況を追跡します。 JVM が停止すると、 後続のネイティブイメージビルドで使用できるネイティブイメージ設定ファイルのコレクションへの実行中に使用された動的機能に関する情報がダンプされます。

source: The native library info file contains information on the static libraries added to the binary and the other libraries dynamically linked to the executable:
ja_jp: ネイティブライブラリ情報ファイルには、バイナリに追加されるスタティックライブラリと、実行可能ファイルに動的にリンクされるその他のライブラリの情報が含まれています。

source: The new Dev Services model maintains backwards compatibility with the old one, so extension owners don't _need_ to do anything. In fact, for the first few releases of the new model, we recommended extension owners definitely did not do anything, while the API stabilised.
ja_jp: 新しい Dev Services モデルは古いモデルとの後方互換性を維持しているため、エクステンション所有者が何かを行う _必要_ はありません。実際、新しいモデルの最初の数リリースでは、API が安定するまでエクステンション所有者は何もしないことを推奨していました。

source: The new Dev UI is available by default. However, because not all the extensions have migrated to the new Dev UI, you can still access the old one at `/q/dev-v1`. The old Dev UI is planned for removal in a future version.
ja_jp: 新しいDev UIはデフォルトで利用可能です。ただし、すべてのエクステンションが新しいDev UIに移行しているわけではないので、まだ古いDev UIにアクセスすることができます（ `/q/dev-v1` ）。古いDev UIは、将来のバージョンで削除される予定です。

source: The new Elasticsearch Java Client is supported as a brand-new extension. This solves the licensing problems that prevented us from updating the deprecated High Level REST Client.
ja_jp: 新しいElasticsearch Java Clientは、全く新しいエクステンションとしてサポートされます。これにより、非推奨となったHigh Level REST Clientのアップデートを妨げていたライセンス問題が解決されました。

source: The new OpenTelemetry API must be used instead. This is one way to migrate the code:
ja_jp: 代わりに新しい OpenTelemetry API を使用する必要があります。これはコードを移行する 1 つの方法です。

source: The new `Emitter.send` method returns a `CompletionStage` completed when the produced message is acknowledged.
ja_jp: 新しい `Emitter.send` メソッドは、生成されたメッセージが確認応答されると、 `CompletionStage` の完了を返します。

source: The new `quarkus-liquibase-mongodb` introduces support for Liquibase migrations to Quarkus applications that use MongoDB.
ja_jp: 新しい `quarkus-liquibase-mongodb` は、MongoDBを使用するQuarkusアプリケーションへのLiquibaseマイグレーションのサポートを導入しました。

source: The new `quarkus.smallrye-openapi.store-schema-directory` property allows you to do exactly that.
ja_jp: 新しい `quarkus.smallrye-openapi.store-schema-directory` プロパティーを使用すると、まさにそれが可能になります。

source: The new bearer access token must have the same `sub` claim value as the token used during the initial HTTP request. Please also make sure the `SecurityIdentity` is only updated when necessary and the WebSocket message with credentials do not appear in your application logs. Always use the `wss` protocol to enforce encrypted HTTP connection via TLS when sending credentials as part of the WebSocket message.
ja_jp: 新しいベアラーアクセストークンは、最初の HTTP リクエスト中に使用されたトークンと同じ `sub` クレーム値を持つ必要があります。また、`SecurityIdentity` は必要な場合にのみ更新され、クレデンシャルを含む WebSocket メッセージがアプリケーションログに表示されないようにしてください。WebSocket メッセージの一部としてクレデンシャルを送信する場合は、TLS を介して暗号化された HTTP 接続を強制するために、常に `wss` プロトコルを使用してください。

source: The new cost of loading
ja_jp: ロードにかかる新たなコスト

source: The new one is added:
ja_jp: 新しいものが追加されました。

source: The new project imports two BOMs (i.e. two fragments of the `io.quarkus:quarkus-universe-bom` that are relevant to the project):
ja_jp: 新しいプロジェクトでは、2つのBOM（すなわち、プロジェクトに関連する `io.quarkus:quarkus-universe-bom` の2つのフラグメント）をインポートします。

source: The next example demonstrates that using the Hibernate Reactive API (without Panache):
ja_jp: 以下は、Hibernate Reactive API (Panache なし) を使用する場合の例になります。

source: The next line
ja_jp: 次の行

source: The next lines
ja_jp: 次の行

source: The next section covers (2).
ja_jp: 次のセクションで(2)について説明します。

source: The next section describes adapters for common open-source logging APIs.
ja_jp: 次のセクションでは、一般的なオープンソースロギング API 用のアダプターについて説明します。

source: The next step is to create a DAO (Data Access Object) interface that will manage instances of `Fruit` entities:
ja_jp: 次のステップでは、 `Fruit` エンティティーのインスタンスを管理する DAO (データアクセスオブジェクト) インターフェイスを作成します。

source: The next step is to decide how to secure the claims.
ja_jp: 次のステップでは、クレームの保護方法を決定します。

source: The next step is to deploy Knative Event triggers for each of the event types. As noted in the code section, each Funqy function is mapped to a specific Cloud Event type. You must create Knative Event triggers that map a Cloud Event and route it to a specific Kubernetes service. We have 4 different triggers.
ja_jp: 次のステップは、それぞれのイベントタイプにKnative Eventトリガーを展開することです。コードセクションで述べたように、Funqyの各関数は特定のCloud Eventタイプにマッピングされています。Cloud Eventをマッピングし、特定のKubernetesサービスにルーティングするKnative Event Triggersを作成する必要があります。トリガーは4種類あります。

source: The next step is to ensure that the returned access token can be useful and is valid to the current Quarkus endpoint. The first way is to call the OAuth2 provider introspection endpoint by configuring `quarkus.oidc.introspection-path`, if the provider offers such an endpoint. In this case, you can use the access token as a source of roles using `quarkus.oidc.roles.source=accesstoken`. If no introspection endpoint is present, you can attempt instead to request <<code-flow-user-info,UserInfo>> from the provider as it will at least validate the access token. To do so, specify `quarkus.oidc.token.verify-access-token-with-user-info=true`. You also need to set the `quarkus.oidc.user-info-path` property to a URL endpoint that fetches the user info (or to an endpoint protected by the access token). For GitHub, since it does not have an introspection endpoint, requesting the UserInfo is required.
ja_jp: 次の手順は、返されたアクセストークンが有用であり、現在の Quarkus エンドポイントに対して有効だと確認することです。 最初の方法は、 `quarkus.oidc.introspection-path` を設定して OAuth2 プロバイダーのイントロスペクションエンドポイントを呼び出すことです (プロバイダーがそのようなエンドポイントを提供している場合)。 この場合、 `quarkus.oidc.roles.source=accesstoken` を使用して、アクセストークンをロールのソースとして使用できます。 イントロスペクションエンドポイントが存在しない場合は、代わりに <<code-flow-user-info,UserInfo>> (少なくともアクセストークンを検証するため) をプロバイダーにリクエストすることを試行できます。 これを行うには、 `quarkus.oidc.token.verify-access-token-with-user-info=true` を指定します。 また、 `quarkus.oidc.user-info-path` プロパティーを、ユーザー情報を取得する URL エンドポイント (またはアクセストークンによって保護されたエンドポイント) に設定する必要もあります。 GitHub の場合、イントロスペクションエンドポイントがないため、UserInfo をリクエストする必要があります。

source: The next step is to ensure that the returned access token can be useful to the current Quarkus endpoint. If the OAuth2 provider supports the introspection endpoint then you may be able to use this access token as a source of roles with `quarkus.oidc.roles.source=accesstoken`. If no introspection endpoint is available then at the very least it should be possible to request <<user-info,UserInfo>> from this provider with `quarkus.oidc.authentication.user-info-required` - this is the case with GitHub.
ja_jp: 次のステップは、返されたアクセストークンが現在のQuarkusエンドポイントに有用であることを確認することです。OAuth2 プロバイダーがintrospection エンドポイントをサポートしている場合、 `quarkus.oidc.roles.source=accesstoken` でロールのソースとしてこのアクセストークンを使用できる場合があります。イントロスペクションエンドポイントが利用できない場合、最低限、このプロバイダから `quarkus.oidc.authentication.user-info-required` で <<user-info,ユーザー情報>> をリクエストすることが可能であるべきです （これは、GitHub の場合です)。

source: The next step is to ensure that the returned access token can be useful to the current Quarkus endpoint. If the `OAuth2` provider supports the introspection endpoint then you may be able to use this access token as a source of roles with `quarkus.oidc.roles.source=accesstoken`. If no introspection endpoint is available then at the very least it should be possible to request <<user-info,UserInfo>> from this provider with `quarkus.oidc.authentication.user-info-required` - this is the case with `GitHib`.
ja_jp: 次のステップは、返されたアクセストークンが現在のQuarkusエンドポイントで使用できることを確認することです。 `OAuth2` プロバイダが introspection エンドポイントをサポートしている場合、このアクセストークンを `quarkus.oidc.roles.source=accesstoken` でロールのソースとして使用することができます。 introspection エンドポイントがない場合、少なくとも `quarkus.oidc.authentication.user-info-required` でこのプロバイダから xref:user-info[UserInfo] を要求することができるはずです - これは `GitHib` の場合です。

source: The next step is to ensure that the returned access token is usable and valid for the current Quarkus endpoint. The first way is to call the OAuth2 provider's introspection endpoint by configuring `quarkus.oidc.introspection-path`, if the provider offers one. In this case, you can use the access token as a source of roles using `quarkus.oidc.roles.source=accesstoken`.
ja_jp: 次の手順は、返されたアクセストークンが現在の Quarkus エンドポイントに対して有用かつ有効であることを確認することです。 最初の方法は、プロバイダーがイントロスペクションエンドポイントを提供している場合、 `quarkus.oidc.introspection-path` を設定して OAuth2 プロバイダーのイントロスペクションエンドポイントを呼び出すことです。 この場合、 `quarkus.oidc.roles.source=accesstoken` を使用して、アクセストークンをロールのソースとして使用できます。

source: The next step is to implement the `LoadBalancer` interface:
ja_jp: 次のステップは、 `LoadBalancer` インターフェースを実装することです。

source: The next step is to inject either `quarkus.oidc.client.registration.OidcClientRegistration` if only a single default client registration is done, or `quarkus.oidc.client.registration.OidcClientRegistrations` if more than one registration is configured, and use metadata of the clients registered with these configurations.
ja_jp: 次のステップで、デフォルトのクライアント登録を 1 つだけ行う場合は `quarkus.oidc.client.registration.OidcClientRegistration` を、複数の登録を設定する場合は `quarkus.oidc.client.registration.OidcClientRegistrations` を挿入し、これらの設定で登録されたクライアントのメタデータを使用します。

source: The next step is to introduce role-based access control (RBAC) to have users in a specific role only, such as `admin`, be able to access the endpoint.
ja_jp: 次の手順では、ロールベースのアクセス制御 (RBAC) を導入して、 `admin` など特定のロールを持つユーザーのみがエンドポイントにアクセスできるようにします。

source: The next table lists the different variants of the `protoc` and plugin artifacts:
ja_jp: 次の表は、 `protoc` とプラグインアーティファクトのさまざまなバリアントを示しています。

source: The next thing you should do is to persist the already registered client's registration URI and registration token at the shutdown time, you can get them from the `io.quarkus.oidc.client.registration.RegisteredClient` instance.
ja_jp: 次に、シャットダウン時にすでに登録されているクライアントの登録 URI と登録トークンを保持する必要があります。これらは、 `io.quarkus.oidc.client.registration.RegisteredClient` インスタンスから取得できます。

source: The node name cannot be longer than 28 bytes. To automatically shorten names longer than 28 bytes, set `quarkus.transaction-manager.shorten-node-name-if-necessary` to `true`.
ja_jp: ノード名は28バイトより長くできません。 28バイトより長い名前を自動的に短縮するには、 `quarkus.transaction-manager.shorten-node-name-if-necessary` を `true` に設定します。

source: The node name identifier may be configured via the property `quarkus.transaction-manager.node-name`.
ja_jp: ノード名識別子は、プロパティー `quarkus.transaction-manager.node-name` にて設定します。

source: The node name identifier needs to be unique per transaction manager deployment. And the node identifier needs to be stable over the transaction manager restarts.
ja_jp: ノード名識別子は、トランザクションマネージャーのデプロイメントごとに一意である必要があります。また、ノード識別子はトランザクションマネージャーの再起動時に変化しない必要があります。

source: The node name identifier plays a crucial part in the identification of a transaction. The node name identifier is forged into the transaction id when the transaction is created. Based on the node name identifier, the transaction manager is capable of recognizing the XA transaction counterparts created in database or JMS broker. The identifier makes possible for the transaction manager to roll back the transaction counterparts during recovery.
ja_jp: ノード名識別子はトランザクションの識別において重要な役割を果たします。ノード名識別子は、トランザクションが作成されるときに、トランザクションIDの作成に使用されます。ノード名識別子に基づいて、トランザクションマネージャーはデータベースまたはJMSブローカに作成されたXAトランザクションのカウンターパートを認識することができます。この識別子により、トランザクションマネージャーはリカバリ中にトランザクションのカウンターパートをロールバックすることが可能になる。

source: The non-reactive mailer blocks until the messages are sent to the SMTP server. Note that does not mean that the message is delivered, just that it's been sent successfully to the SMTP server, which will be responsible for the delivery.
ja_jp: 非リアクティブ型Mailerは、メッセージがSMTPサーバーに送信されるまでブロックします。これは、メッセージが配信されたことを意味するのではなく、配信を担当するSMTPサーバに正常に送信されたことを意味することに注意してください。

source: The notion of "cheap blocking" might not always be true: in certain occasions a virtual thread might "pin" its carrier (the platform thread it is mounted upon). In this situation, the platform thread is blocked exactly as it would have been in a typical blocking scenario.
ja_jp: 仮想スレッドがそのキャリア(マウントされているプラットフォームスレッド)を"拘束"する場合があります。この場合はプラットフォームスレッドは通常のブロッキングシナリオと同じようにブロックされます。

source: The notion of migration/setup work being done in init containers is available for other extensions to implement and support.
ja_jp: init containersで行われるマイグレーション/セットアップ作業という概念は、他のエクステンションが実装しサポートすることも可能です。

source: The number of RabbitMQ connections to create for consuming from this queue. This might be necessary to consume from a sharded queue with a single client. Type: _int_
ja_jp: このキューから消費するために作成するRabbitMQ接続の数です。これは、単一のクライアントでシャードされたキューから消費するために必要な場合があります。 Type: _int_

source: The number of acknowledgments the producer requires the leader to have received before considering a request complete. This controls the durability of records that are sent. Accepted values are: 0, 1, all Type: _string_
ja_jp: リクエストを完了とみなす前に、プロデューサーがリーダーに受信したことを要求する確認応答の数。これは、送信されるレコードの耐久性を制御します。許容される値は 0 、 1 、 または all です。 Type: _string_

source: The number of cache entries is limited by `quarkus.security.ldap.cache.size`, which defaults to `100`.
ja_jp: キャッシュ・エントリ数は `quarkus.security.ldap.cache.size` で制限され、デフォルトは `100` です。

source: The number of concurrent lookup requests that can be sent on each broker connection. Setting a maximum prevents overloading a broker.
ja_jp: 各ブローカー接続で同時に送信できるルックアップ要求の数。最大値を設定することで、ブローカーに過負荷がかかるのを防ぎます。

source: The number of partitions to be consumed concurrently. The connector creates the specified amount of Kafka consumers. It should match the number of partition of the targeted topic Type: _int_
ja_jp: 同時に消費されるパーティションの数です。コネクタは、指定された数のKafkaコンシューマーを作成します。これは、対象となるトピックのパーティション数と一致する必要があります。 Type: _int_

source: The number of reconnection attempts Type: _int_
ja_jp: 再接続の試行回数 Type: _int_

source: The number of values recorded in each bucket.
ja_jp: 各バケットに記録された値の数。

source: The number of values recorded.
ja_jp: 記録された値の数。

source: The old OpenTelemetry guide has been split into this generic guide, the xref:opentelemetry-tracing.adoc[OpenTelemetry Tracing Guide], the new xref:opentelemetry-metrics.adoc[OpenTelemetry Metrics Guide] and the xref:opentelemetry-logging.adoc[OpenTelemetry Logging Guide].
ja_jp: 古い OpenTelemetry ガイドは、汎用ガイドである xref:opentelemetry-tracing.adoc[OpenTelemetry トレースガイド]、新しい xref:opentelemetry-metrics.adoc[OpenTelemetry メトリクスガイド]、xref:opentelemetry-logging.adoc[OpenTelemetry Loggingガイド] に分割されました。

source: The omitted output above contains clues to what caused the issue, but in this exercise we are going to assume that no information was provided. Let’s try to debug the segmentation fault using `gdb`. To do that, go to the root of the project and enter the tools container:
ja_jp: 上記の省略された出力には、問題の原因の手がかりが含まれていますが、この演習では情報が提供されなかったと仮定しています。 `gdb` を使用してセグメンテーション違反をデバッグしてみましょう。これを行うには、プロジェクトの root に移動し、ツールコンテナーに入ります。

source: The only configuration which is required to create this Keycloak Admin Client is a Keycloak server URL.
ja_jp: このKeycloak Admin Clientを作成するために必要な設定は、KeycloakサーバーのURLのみです:

source: The only difference from the hello method is the `@Path` and `@LRA` annotations and that it returns the LRA id back to the caller. We will need this to set the header when we send a request to the hello method to finish the LRA (note that this header is also available in one of the JAX-RS response headers).
ja_jp: helloメソッドとの唯一の違いは、 `@Path` と `@LRA` のアノテーションがあることと、LRA IDを呼び出し元に返すことです。これは、LRAを終了させるためにhelloメソッドにリクエストを送信する際に、ヘッダーを設定するために必要となります（このヘッダーは、JAX-RSのレスポンスヘッダーの1つでも利用可能であることに注意してください）。

source: The only difference is the name of `QuarkusTestResource`:
ja_jp: 唯一の違いは `QuarkusTestResource` の名前です。

source: The only different property from a Hibernate ORM configuration
ja_jp: Hibernate ORMの設定と唯一異なるプロパティ

source: The only drawback compared to the original solution was that our regression test suite was slower to run, essentially because our tests generated resources in the context of a specific configuration. And since we were using _MP config_, we needed to boot a new Quarkus context every time we wanted to test a different configuration. Fortunately booting a new context is extremely fast in Quarkus, but still a lot slower than with our original plain Java solution.
ja_jp: オリジナルのソリューションと比較した場合の唯一の欠点は、リグレッションテストスイートの実行が遅くなったことです。 _MPconfig_を使用していたので、異なるコンフィグをテストするたびに、新しいQuarkusコンテキストを起動する必要がありました。幸いなことに、新しいコンテキストの起動はQuarkusでは非常に高速ですが、それでも元々のプレーンなJavaソリューションに比べればかなり遅いです。

source: The only exception where accepting all origins might be appropriate in production is for read-only public API applications that have no side effects of any kind, such as managing cookies, saving request data on the disk, or similar operations. In such cases, to improve the HTTP cache performance, you might want to return a literal `*` origin by setting `quarkus.http.cors.return-exact-origins=false` to avoid the `Vary: Origin` response header.
ja_jp: 本番環境で全てのオリジンを受け入れることが適切となる唯一の例外は、Cookie の管理、リクエストデータのディスクへの保存、または同様の操作など、いかなる種類の副作用もない読み取り専用の公開 API アプリケーションの場合です。 このような場合、HTTP キャッシュのパフォーマンスを向上させるため、`Vary: Origin` レスポンスヘッダーを避けるために `quarkus.http.cors.return-exact-origins=false` を設定してリテラル `*` オリジンを返すことを検討してもよいでしょう。

source: The only interface to implement is:
ja_jp: 実装するインターフェースはこれだけです。

source: The only mandatory configuration for OpenTelemetry Logging is the one enabling it:
ja_jp: OpenTelemetry Loggingで必須の設定は、ロギングを有効にすることだけです：

source: The only mandatory configuration for OpenTelemetry Metrics is the one enabling it:
ja_jp: OpenTelemetry メトリクスの唯一の必須設定は、これを有効にする設定です。

source: The only option is an indirect access token verification by attempting to use this binary token to access an OIDC standard or OAuth2 provider specific UserInfo endpoint, when a valid access token must be forwarded to the UserInfo endpoint. Set `quarkus.oidc.token.verify-access-token-with-user-info=true` if it is what is necessary in your case.
ja_jp: 唯一のオプションは、有効なアクセストークンを UserInfo エンドポイントに転送する必要がある際に、このバイナリトークンを使用して OIDC 標準または OAuth2 プロバイダー固有の UserInfo エンドポイントへのアクセスを試みることによる間接的なアクセストークン検証です。必要に応じて `quarkus.oidc.token.verify-access-token-with-user-info=true` を設定してください。

source: The only particular aspect of writing Quarkus extensions in Eclipse is that APT (Annotation Processing Tool) is required as part of extension builds, which means you need to:
ja_jp: EclipseでQuarkusエクステンションを書く際の唯一の特別な点は、エクステンションのビルドの一部としてAPT（Annotation Processing Tool）が必要であることです。つまり、以下が必要です:

source: The only prerequisite for the NodeJS project to be compatible with Quinoa is to have a `build` script. It should produce static files in a specific directory (index.html, javascript, css, ...). Since teams can be different, to make everyone happy, it is possible to either have the web UI in the Quarkus project (default is `src/main/webui`) or outside (as long as it is available on the disk at build time).
ja_jp: NodeJSプロジェクトがQuinoaと互換性を持つための唯一の前提条件は、 `build` スクリプトを持っていることです。これは、特定のディレクトリに静的なファイル（index.html、javascript、css、...）を生成する必要があります。チームはさまざまなので、全員が満足できるように、ウェブUIをQuarkusプロジェクト内（デフォルトは `src/main/webui` ）または外（ビルド時にディスク上で利用可能である限り）に置くことが可能です。

source: The only real difference between the Minikube and Kubernetes descriptors is that all the application ``Service``s in the Minikube descriptors use `+type: NodePort+` so that a list of all the applications can be obtained simply by running `+minikube service list+`.
ja_jp: MinikubeとKubernetesのディスクリプターの唯一の違いは、Minikubeのディスクリプターに含まれる全てのアプリケーション `Service`が `type: NodePort` を使用していることで、 `minikube service list` を実行するだけで全てのアプリケーションのリストを取得することができます。

source: The only thing you have to do is add `@Blocking` on your endpoint method or class. That’s it! If you use `@Blocking` you are back to the regular dispatching mechanism: a worker thread is used to execute your method.
ja_jp: エンドポイントのメソッドやクラスに `@Blocking` を追加するだけです。これだけです。 `@Blocking` を使用すると、通常のディスパッチの仕組み:ワーカースレッドがメソッドの実行に使用される方式に戻れます。

source: The operation of compiling Java bytecode into a native system-specific machine code is named *Ahead of Time Compilation* (aka AoT).
ja_jp: Java バイトコードをネイティブシステム固有のマシンコードにコンパイルする操作は、*Ahead of Time Compilation* (AoT) と呼ばれています。

source: The optimization can be disabled by setting `quarkus.arc.remove-unused-beans` to `none` or `false`. Quarkus also provides a middle ground where application beans are never removed whether or not they are unused, while the optimization proceeds normally for non application classes. To use this mode, set `quarkus.arc.remove-unused-beans` to `fwk` or `framework`.
ja_jp: この最適化は、 `quarkus.arc.remove-unused-beans` を `none` または `false` に設定することで無効にすることができます。Quarkus では、アプリケーションの Bean は未使用かどうかにかかわらず削除されず、アプリケーション以外のクラスは通常通りに最適化が行われるという中間モードも提供されています。このモードを使用するには、 `quarkus.arc.remove-unused-beans` を `fwk` または `framework` に設定します。

source: The optimization can be disabled by setting `quarkus.arc.remove-unused-beans` to `none` or `false`. Quarkus also provides a middle ground where application beans are never removed, whether or not they are unused, while the optimization proceeds normally for non application classes. To use this mode, set `quarkus.arc.remove-unused-beans` to `fwk` or `framework`.
ja_jp: この最適化は、`quarkus.arc.remove-unused-beans` を `none` または `false` に設定することで無効にできます。Quarkus はまた、アプリケーション Bean が未使用かどうかに関わらず削除されず、非アプリケーションクラスの最適化は通常どおり続行される中間的な方法も提供します。このモードを使用するには、`quarkus.arc.remove-unused-beans` を `fwk` または `framework` に設定します。
